# Sección de **Introducción**: *Series*

In [1]:
import pandas as pd 
import numpy as np

In [2]:
sr = pd.Series([10, 9, 8, 7 , 6])

In [3]:
sr.values

array([10,  9,  8,  7,  6], dtype=int64)

In [4]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
sr.shape

(5,)

In [6]:
sr[[0, 4, 2]] # Doble corchete para poder seleccionar varios index

0    10
4     6
2     8
dtype: int64

In [7]:
sr = pd.Series([10, 9, 8, 7 , 6], index=['a', 'b', 'c', 'd', 'e'])
sr['b':'e']

b    9
c    8
d    7
e    6
dtype: int64

In [8]:
dict_data = {'CO':100, 'MX':200, 'AR':300}
dict_data

{'CO': 100, 'MX': 200, 'AR': 300}

In [9]:
dict_data.keys()

dict_keys(['CO', 'MX', 'AR'])

In [10]:
dict_data['MX']

200

In [11]:
sr = pd.Series(dict_data, index = ['CO', 'MX', 'PE'])

In [12]:
np.nan

nan

In [13]:
np.nan + 10

nan

In [14]:
sr.isnull()

CO    False
MX    False
PE     True
dtype: bool

# Trabajando con DF

In [15]:
dict_data = {'CH': [100, 800, 200], 'CO':[100, 200, 300], 'MX':[300, 500, 400]}

In [16]:
df = pd.DataFrame(dict_data)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [17]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
dict_data

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9]}

In [18]:
df = pd.DataFrame(dict_data, index=['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [19]:
df.loc['ana', ['edad', 'cm', 'Q1']]

edad     10
cm      115
Q1      5.0
Name: ana, dtype: object

In [20]:
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [21]:
df.iloc[2,1]

130

In [22]:
df.iloc[:,[1,3]]

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriela  125      F

In [23]:
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [24]:
df[df['edad']>=12]

          edad   cm pais genero   Q1  Q2
camilo      13  130   co      F  8.0   9
daniel      14  155   mx      M  NaN   8
erika       12  125   mx      M  7.0   8
gabriela    12  125   ch      F  3.0   9

In [25]:
df[(df['edad']>=12) & (df['pais']=='mx')]

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

In [26]:
df.query('edad>=12')

          edad   cm pais genero   Q1  Q2
camilo      13  130   co      F  8.0   9
daniel      14  155   mx      M  NaN   8
erika       12  125   mx      M  7.0   8
gabriela    12  125   ch      F  3.0   9

In [27]:
df['Q2']>=df['Q1']

ana          True
benito      False
camilo       True
daniel      False
erika        True
fabian       True
gabriela     True
dtype: bool

In [28]:
df[df['Q2']>=df['Q1']]

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
camilo      13  130   co      F  8.0   9
erika       12  125   mx      M  7.0   8
fabian      11  120   ch      M  8.0   8
gabriela    12  125   ch      F  3.0   9

# Manejo de archivos CSV

In [29]:
%cd "C:\Users\furruchurtu\OneDrive - LITOPLAS SA\Documentos\python"

c:\Users\furruchurtu\OneDrive - LITOPLAS SA\Documentos\python

In [30]:
df.to_csv('test.csv', index=False)

df_read = pd.read_csv('test.csv')
df_read

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

# Conectando con Postgre o con MySQL

## Para conectar con Postgres: Dar doble clic para copiar código

import pandas as pd
import psycopg2

### Se hace la conexión: No se ejecuta nada por seguridad
### **Código:**

conn_sql = psycopg2.connect(
    user = 'user_name',
    password = 'password',
    host = 'xxx.xxx.xxx.xxx',
    port = '5432',
    database = 'postgres data base'
)

query_sql = '''
select *
from table_name
limit 10
'''

### Se crea el dataframe:
df = pd.read_sql(query_sql, sql_conn)
df.head(5)

## Conectando con MySQL:

import pandas as pd
import sqlalchemy as sql

### Escogemos nuestra base de datos, Oracle, MySql o la de tu preferencia:

database_type = 'mysql'
database_type = 'oracle'

### Luego creamos el elemento de conexión con el siguiente código:

user = 'user_name'
password = 'password'
host = 'xxx.xxx.xxx.xxx:port'
database = 'database_name'

conn_string = '{}://{}:{}@{}/{}'.format(
database_type, user, password, host, database)

sql_conn = sql.create_engine(conn_string)

### Seguido simplemente definimos nuestra query en SQL:

query_sql = '''
select *
from table_name
limit 10
'''

### Y creamos nuestro dataframe con:

df = pd.read_sql(query_sql, sql_conn)
df.head(5)

# Manejo de pandas
## Analizando Dataframes

In [31]:
df_meteorites = pd.read_csv('Meteorite_Landings.csv')

In [32]:
df_meteorites

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037, 17.0185)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.78333, 8.96667)"
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.25, 17.66667)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.78917, 41.5046)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.98333, -115.68333)"

In [34]:
df_meteorites.sample(10)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
29344,Northwest Africa 5395,49125,Valid,L6,123.00,Found,01/01/2006 12:00:00 AM,0.00000,0.00000,"(0.0, 0.0)"
26609,Northwest Africa 1236,17187,Valid,H4,171.00,Found,01/01/2000 12:00:00 AM,NaN,NaN,NaN
36302,Roosevelt County 011,22666,Valid,H5,2.90,Found,01/01/1980 12:00:00 AM,33.75000,-103.13333,"(33.75, -103.13333)"
24678,Miller Range 07303,52225,Valid,CO3,1.60,Found,01/01/2007 12:00:00 AM,0.00000,0.00000,"(0.0, 0.0)"
34389,Queen Alexandra Range 97755,21211,Valid,H6,8.30,Found,01/01/1997 12:00:00 AM,-84.00000,168.00000,"(-84.0, 168.0)"
10615,Elephant Moraine 90600,9009,Valid,L6,34.20,Found,01/01/1990 12:00:00 AM,-76.27467,156.40709,"(-76.27467, 156.40709)"
5870,Dar al Gani 1052,53617,Valid,LL5,280.00,Found,01/01/2008 12:00:00 AM,27.32833,16.21867,"(27.32833, 16.21867)"
44548,Yamato 982293,38915,Valid,H5,5.26,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.0, 0.0)"
18485,LaPaz Icefield 03932,34749,Valid,L5,1.02,Found,01/01/2003 12:00:00 AM,NaN,NaN,NaN
4229,Asuka 881196,3905,Valid,L3,29.01,Found,01/01/1988 12:00:00 AM,-72.00000,26.00000,"(-72.0, 26.0)"

In [35]:
df_meteorites.shape

(45716, 10)

In [36]:
df_meteorites.size

457160

In [41]:
df_meteorites.describe()

            id     mass (g)   reclat  reclong
count 45,716.0     45,585.0 38,401.0 38,401.0
mean  26,889.7     13,278.1    -39.1     61.1
std   16,860.7    574,988.9     46.4     80.6
min        1.0          0.0    -87.4   -165.4
25%   12,688.8          7.2    -76.7      0.0
50%   24,261.5         32.6    -71.5     35.7
75%   40,656.8        202.6      0.0    157.2
max   57,458.0 60,000,000.0     81.2    354.5

In [40]:
pd.options.display.float_format = '{:,.1f}'.format

In [42]:
df_meteorites.describe(include = 'all')
# Esto nos muestra los valores de texto también

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
count,45716,"45,716.0",45716,45716,"45,585.0",45716,45425,"38,401.0","38,401.0",38401
unique,45716,NaN,2,466,NaN,2,266,NaN,NaN,17100
top,Aachen,NaN,Valid,L6,NaN,Found,01/01/2003 12:00:00 AM,NaN,NaN,"(0.0, 0.0)"
freq,1,NaN,45641,8285,NaN,44609,3323,NaN,NaN,6214
mean,NaN,"26,889.7",NaN,NaN,"13,278.1",NaN,NaN,-39.1,61.1,NaN
std,NaN,"16,860.7",NaN,NaN,"574,988.9",NaN,NaN,46.4,80.6,NaN
min,NaN,1.0,NaN,NaN,0.0,NaN,NaN,-87.4,-165.4,NaN
25%,NaN,"12,688.8",NaN,NaN,7.2,NaN,NaN,-76.7,0.0,NaN
50%,NaN,"24,261.5",NaN,NaN,32.6,NaN,NaN,-71.5,35.7,NaN
75%,NaN,"40,656.8",NaN,NaN,202.6,NaN,NaN,0.0,157.2,NaN
max,NaN,"57,458.0",NaN,NaN,"60,000,000.0",NaN,NaN,81.2,354.5,NaN

In [45]:
df_meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [46]:
pd.__version__

'1.3.2'

In [50]:
df_meteorites.convert_dtypes().dtypes 

#Esta línea muestra cuales son strings

name            string
id               Int64
nametype        string
recclass        string
mass (g)       Float64
fall            string
year            string
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object

In [51]:
df_meteorites.nunique()
#Este sirve para conocer cuales son las variables categóricas

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [52]:
df_meteorites[['fall', 'nametype']]= df_meteorites[['fall', 'nametype']].astype('category')
df_meteorites
#Esto lo hace categórico a al dataframe

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.8,6.1,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.2,10.2,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,"107,000.0",Fell,01/01/1952 12:00:00 AM,54.2,-113.0,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,01/01/1976 12:00:00 AM,16.9,-99.9,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.2,-65.0,"(-33.16667, -64.95)"
...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.0,17.0,"(29.037, 17.0185)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.8,9.0,"(13.78333, 8.96667)"
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.2,17.7,"(49.25, 17.66667)"
45714,Zubkovsky,31357,Valid,L6,"2,167.0",Found,01/01/2003 12:00:00 AM,49.8,41.5,"(49.78917, 41.5046)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,34.0,-115.7,"(33.98333, -115.68333)"

In [54]:
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

In [55]:
df_meteorites['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [56]:
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [57]:
pd.get_dummies(df_meteorites['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

In [58]:
df_meteorites[['fell', 'found']] = pd.get_dummies(df_meteorites['fall'])
df_meteorites

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.8,6.1,"(50.775, 6.08333)",1,0
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.2,10.2,"(56.18333, 10.23333)",1,0
2,Abee,6,Valid,EH4,"107,000.0",Fell,01/01/1952 12:00:00 AM,54.2,-113.0,"(54.21667, -113.0)",1,0
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,01/01/1976 12:00:00 AM,16.9,-99.9,"(16.88333, -99.9)",1,0
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.2,-65.0,"(-33.16667, -64.95)",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.0,17.0,"(29.037, 17.0185)",0,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.8,9.0,"(13.78333, 8.96667)",0,1
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.2,17.7,"(49.25, 17.66667)",0,1
45714,Zubkovsky,31357,Valid,L6,"2,167.0",Found,01/01/2003 12:00:00 AM,49.8,41.5,"(49.78917, 41.5046)",0,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,34.0,-115.7,"(33.98333, -115.68333)",0,1

In [59]:
df_meteorites['year']

0        01/01/1880 12:00:00 AM
1        01/01/1951 12:00:00 AM
2        01/01/1952 12:00:00 AM
3        01/01/1976 12:00:00 AM
4        01/01/1902 12:00:00 AM
                  ...
45711    01/01/1990 12:00:00 AM
45712    01/01/1999 12:00:00 AM
45713    01/01/1939 12:00:00 AM
45714    01/01/2003 12:00:00 AM
45715    01/01/1976 12:00:00 AM
Name: year, Length: 45716, dtype: object

In [61]:
pd.to_datetime(
    df_meteorites['year'],
    errors = 'coerce',
    format = '%m/%d/%Y %H:%M:%S %p'
)

#Errors = Ayuda a que si encuentra un valor que no corresponda al formato,
#Lo reemplaza por un valor nulo.

0       1880-01-01 12:00:00
1       1951-01-01 12:00:00
2       1952-01-01 12:00:00
3       1976-01-01 12:00:00
4       1902-01-01 12:00:00
                ...
45711   1990-01-01 12:00:00
45712   1999-01-01 12:00:00
45713   1939-01-01 12:00:00
45714   2003-01-01 12:00:00
45715   1976-01-01 12:00:00
Name: year, Length: 45716, dtype: datetime64[ns]

In [63]:
df_meteorites['year'] = pd.to_datetime(
    df_meteorites['year'],
    errors = 'coerce',
    format = '%m/%d/%Y %H:%M:%S %p'
)

In [64]:
df_meteorites.dtypes

name                   object
id                      int64
nametype             category
recclass               object
mass (g)              float64
fall                 category
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            object
fell                    uint8
found                   uint8
dtype: object

In [65]:
df_meteorites['ones'] = 1

In [66]:
df_meteorites

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,fell,found,ones
0,Aachen,1,Valid,L5,21.0,Fell,1880-01-01 12:00:00,50.8,6.1,"(50.775, 6.08333)",1,0,1
1,Aarhus,2,Valid,H6,720.0,Fell,1951-01-01 12:00:00,56.2,10.2,"(56.18333, 10.23333)",1,0,1
2,Abee,6,Valid,EH4,"107,000.0",Fell,1952-01-01 12:00:00,54.2,-113.0,"(54.21667, -113.0)",1,0,1
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,1976-01-01 12:00:00,16.9,-99.9,"(16.88333, -99.9)",1,0,1
4,Achiras,370,Valid,L6,780.0,Fell,1902-01-01 12:00:00,-33.2,-65.0,"(-33.16667, -64.95)",1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990-01-01 12:00:00,29.0,17.0,"(29.037, 17.0185)",0,1,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999-01-01 12:00:00,13.8,9.0,"(13.78333, 8.96667)",0,1,1
45713,Zlin,30410,Valid,H4,3.3,Found,1939-01-01 12:00:00,49.2,17.7,"(49.25, 17.66667)",0,1,1
45714,Zubkovsky,31357,Valid,L6,"2,167.0",Found,2003-01-01 12:00:00,49.8,41.5,"(49.78917, 41.5046)",0,1,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976-01-01 12:00:00,34.0,-115.7,"(33.98333, -115.68333)",0,1,1

In [67]:
df_meteorites.rename(columns={'mass (g)':'mass'}, inplace= True)

In [69]:
#Aprendamos a como borrar registros o copiar columnas

df_meteorites.drop(['ones'], axis = 1, inplace=True)

In [70]:
df_meteorites

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,1880-01-01 12:00:00,50.8,6.1,"(50.775, 6.08333)",1,0
1,Aarhus,2,Valid,H6,720.0,Fell,1951-01-01 12:00:00,56.2,10.2,"(56.18333, 10.23333)",1,0
2,Abee,6,Valid,EH4,"107,000.0",Fell,1952-01-01 12:00:00,54.2,-113.0,"(54.21667, -113.0)",1,0
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,1976-01-01 12:00:00,16.9,-99.9,"(16.88333, -99.9)",1,0
4,Achiras,370,Valid,L6,780.0,Fell,1902-01-01 12:00:00,-33.2,-65.0,"(-33.16667, -64.95)",1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990-01-01 12:00:00,29.0,17.0,"(29.037, 17.0185)",0,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999-01-01 12:00:00,13.8,9.0,"(13.78333, 8.96667)",0,1
45713,Zlin,30410,Valid,H4,3.3,Found,1939-01-01 12:00:00,49.2,17.7,"(49.25, 17.66667)",0,1
45714,Zubkovsky,31357,Valid,L6,"2,167.0",Found,2003-01-01 12:00:00,49.8,41.5,"(49.78917, 41.5046)",0,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976-01-01 12:00:00,34.0,-115.7,"(33.98333, -115.68333)",0,1

In [71]:
df_meteorites.drop([0,2,3,6]).head(10)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
1,Aarhus,2,Valid,H6,720.0,Fell,1951-01-01 12:00:00,56.2,10.2,"(56.18333, 10.23333)",1,0
4,Achiras,370,Valid,L6,780.0,Fell,1902-01-01 12:00:00,-33.2,-65.0,"(-33.16667, -64.95)",1,0
5,Adhi Kot,379,Valid,EH4,"4,239.0",Fell,1919-01-01 12:00:00,32.1,71.8,"(32.1, 71.8)",1,0
7,Agen,392,Valid,H5,"30,000.0",Fell,1814-01-01 12:00:00,44.2,0.6,"(44.21667, 0.61667)",1,0
8,Aguada,398,Valid,L6,"1,620.0",Fell,1930-01-01 12:00:00,-31.6,-65.2,"(-31.6, -65.23333)",1,0
9,Aguila Blanca,417,Valid,L,"1,440.0",Fell,1920-01-01 12:00:00,-30.9,-64.5,"(-30.86667, -64.55)",1,0
10,Aioun el Atrouss,423,Valid,Diogenite-pm,"1,000.0",Fell,1974-01-01 12:00:00,16.4,-9.6,"(16.39806, -9.57028)",1,0
11,Aïr,424,Valid,L6,"24,000.0",Fell,1925-01-01 12:00:00,19.1,8.4,"(19.08333, 8.38333)",1,0
12,Aire-sur-la-Lys,425,Valid,Unknown,NaN,Fell,1769-01-01 12:00:00,50.7,2.3,"(50.66667, 2.33333)",1,0
13,Akaba,426,Valid,L6,779.0,Fell,1949-01-01 12:00:00,29.5,35.0,"(29.51667, 35.05)",1,0

In [73]:
df_copy = df_meteorites.copy(deep=True)

# Haciendo aplicaciones avanzadas de Pandas

## Funciones, trabajando con variables tipo texto, etc

In [76]:
import numpy as np
import pandas as pd

In [74]:
df_bikes = pd.read_csv('london_merged.csv')
df_bikes.head(10)

,timestamp,cnt,t1,t2,hum,wind_speed,weather_code,is_holiday,is_weekend,season
0,2015-01-04 00:00:00,182,3.0,2.0,93.0,6.0,3.0,0.0,1.0,3.0
1,2015-01-04 01:00:00,138,3.0,2.5,93.0,5.0,1.0,0.0,1.0,3.0
2,2015-01-04 02:00:00,134,2.5,2.5,96.5,0.0,1.0,0.0,1.0,3.0
3,2015-01-04 03:00:00,72,2.0,2.0,100.0,0.0,1.0,0.0,1.0,3.0
4,2015-01-04 04:00:00,47,2.0,0.0,93.0,6.5,1.0,0.0,1.0,3.0
5,2015-01-04 05:00:00,46,2.0,2.0,93.0,4.0,1.0,0.0,1.0,3.0
6,2015-01-04 06:00:00,51,1.0,-1.0,100.0,7.0,4.0,0.0,1.0,3.0
7,2015-01-04 07:00:00,75,1.0,-1.0,100.0,7.0,4.0,0.0,1.0,3.0
8,2015-01-04 08:00:00,131,1.5,-1.0,96.5,8.0,4.0,0.0,1.0,3.0
9,2015-01-04 09:00:00,301,2.0,-0.5,100.0,9.0,3.0,0.0,1.0,3.0

In [78]:
df_bikes.convert_dtypes().dtypes

timestamp        string
cnt               Int64
t1              Float64
t2              Float64
hum             Float64
wind_speed      Float64
weather_code      Int64
is_holiday        Int64
is_weekend        Int64
season            Int64
dtype: object

In [79]:
df_bikes['timestamp'] = pd.to_datetime(df_bikes['timestamp'], errors='coerce')
df_bikes.convert_dtypes().dtypes

timestamp       datetime64[ns]
cnt                      Int64
t1                     Float64
t2                     Float64
hum                    Float64
wind_speed             Float64
weather_code             Int64
is_holiday               Int64
is_weekend               Int64
season                   Int64
dtype: object

In [81]:
df_bikes['hour'] = df_bikes['timestamp'].dt.hour
df_bikes['hour']

0         0
1         1
2         2
3         3
4         4
         ..
17409    19
17410    20
17411    21
17412    22
17413    23
Name: hour, Length: 17414, dtype: int64

In [82]:
df = df_bikes.iloc[:,1:]

In [83]:
df

,cnt,t1,t2,hum,wind_speed,weather_code,is_holiday,is_weekend,season,hour
0,182,3.0,2.0,93.0,6.0,3.0,0.0,1.0,3.0,0
1,138,3.0,2.5,93.0,5.0,1.0,0.0,1.0,3.0,1
2,134,2.5,2.5,96.5,0.0,1.0,0.0,1.0,3.0,2
3,72,2.0,2.0,100.0,0.0,1.0,0.0,1.0,3.0,3
4,47,2.0,0.0,93.0,6.5,1.0,0.0,1.0,3.0,4
...,...,...,...,...,...,...,...,...,...,...
17409,1042,5.0,1.0,81.0,19.0,3.0,0.0,0.0,3.0,19
17410,541,5.0,1.0,81.0,21.0,4.0,0.0,0.0,3.0,20
17411,337,5.5,1.5,78.5,24.0,4.0,0.0,0.0,3.0,21
17412,224,5.5,1.5,76.0,23.0,4.0,0.0,0.0,3.0,22
17413,139,5.0,1.0,76.0,22.0,2.0,0.0,0.0,3.0,23

In [85]:
df['wind_speed']**2+10

0        46.0
1        35.0
2        10.0
3        10.0
4        52.2
         ...
17409   371.0
17410   451.0
17411   586.0
17412   539.0
17413   494.0
Name: wind_speed, Length: 17414, dtype: float64

In [86]:
np.sin(df['wind_speed'])

0       -0.3
1       -1.0
2        0.0
3        0.0
4        0.2
        ...
17409    0.1
17410    0.8
17411   -0.9
17412   -0.8
17413   -0.0
Name: wind_speed, Length: 17414, dtype: float64

In [87]:
df['t1']-df['t2']

0       1.0
1       0.5
2       0.0
3       0.0
4       2.0
         ..
17409   4.0
17410   4.0
17411   4.0
17412   4.0
17413   4.0
Length: 17414, dtype: float64

In [90]:
df['t1'].iloc[::3]-df['t2']

0       1.0
1       NaN
2       NaN
3       0.0
4       NaN
         ..
17409   4.0
17410   NaN
17411   NaN
17412   4.0
17413   NaN
Length: 17414, dtype: float64

In [91]:
df['t1'].iloc[::3].sub(df['t2'], fill_value=1000)

0           1.0
1         997.5
2         997.5
3           0.0
4       1,000.0
          ...
17409       4.0
17410     999.0
17411     998.5
17412       4.0
17413     999.0
Length: 17414, dtype: float64

## Funciones más complejas

In [93]:
def fun_1(x):
    y = x**2 + 1
    return y

In [94]:
fun_1(10)

101

In [95]:
np.arange(-5, 6)

array([-5, -4, -3, -2, -1,  0,  1,  2,  3,  4,  5])

In [96]:
fun_1(np.arange(-5, 6))

array([26, 17, 10,  5,  2,  1,  2,  5, 10, 17, 26], dtype=int32)

In [97]:
df['hour'].apply(fun_1)

0          1
1          2
2          5
3         10
4         17
        ...
17409    362
17410    401
17411    442
17412    485
17413    530
Name: hour, Length: 17414, dtype: int64

In [98]:
def fun_2(x, a=1, b= 0):
    y = x**2 + a*x + b
    return y

In [99]:
df['hour'].apply(fun_2, args=(20, -100))

0       -100
1        -79
2        -56
3        -31
4         -4
        ...
17409    641
17410    700
17411    761
17412    824
17413    889
Name: hour, Length: 17414, dtype: int64

In [100]:
df['t1'].apply(lambda x: x + 273)

0       276.0
1       276.0
2       275.5
3       275.0
4       275.0
         ...
17409   278.0
17410   278.0
17411   278.5
17412   278.5
17413   278.0
Name: t1, Length: 17414, dtype: float64

In [101]:
df.apply(lambda x: x.mean())

cnt            1,143.1
t1                12.5
t2                11.5
hum               72.3
wind_speed        15.9
weather_code       2.7
is_holiday         0.0
is_weekend         0.3
season             1.5
hour              11.5
dtype: float64

In [102]:
df.apply(lambda x: x.std())

cnt            1,085.1
t1                 5.6
t2                 6.6
hum               14.3
wind_speed         7.9
weather_code       2.3
is_holiday         0.1
is_weekend         0.5
season             1.1
hour               6.9
dtype: float64

In [103]:
df.applymap(lambda x: x/1000)

,cnt,t1,t2,hum,wind_speed,weather_code,is_holiday,is_weekend,season,hour
0,0.2,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
1,0.1,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
2,0.1,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
3,0.1,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...
17409,1.0,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
17410,0.5,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
17411,0.3,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
17412,0.2,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0
17413,0.1,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0

## Usando otro dataframe

In [105]:
df_pob = pd.read_csv('poblacion.csv')

In [106]:
df_pob.head(10)

               Country  year          pop
0          Afghanistan  2015 34,413,603.0
1              Albania  2015  2,880,703.0
2              Algeria  2015 39,728,025.0
3       American Samoa  2015     55,812.0
4              Andorra  2015     78,011.0
5               Angola  2015 27,884,381.0
6  Antigua and Barbuda  2015     93,566.0
7            Argentina  2015 43,131,966.0
8              Armenia  2015  2,925,553.0
9                Aruba  2015    104,341.0

In [107]:
df_pob['year'] = pd.Categorical(df_pob['year'].apply(str))

In [108]:
df_pob.dtypes

Country      object
year       category
pop         float64
dtype: object

In [109]:
idx_filter = df_pob['Country'].isin(['Aruba','Colombia'])
idx_filter

0       False
1       False
2       False
3       False
4       False
        ...
1035    False
1036    False
1037    False
1038    False
1039    False
Name: Country, Length: 1040, dtype: bool

In [110]:
df_sample = df_pob[idx_filter]
df_sample

      Country  year          pop
9       Aruba  2015    104,341.0
42   Colombia  2015 47,520,667.0
269     Aruba  2016    104,872.0
302  Colombia  2016 48,171,392.0
529     Aruba  2017    105,366.0
562  Colombia  2017 48,901,066.0
789     Aruba  2018    105,845.0
822  Colombia  2018 49,648,685.0

In [111]:
df_sample = df_sample.set_index(['Country', 'year']).sort_index()
df_sample

                       pop
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [113]:
df_sample.loc['Colombia', :]

              pop
year
2015 47,520,667.0
2016 48,171,392.0
2017 48,901,066.0
2018 49,648,685.0

In [114]:
df_sample.loc['Colombia', :].loc['2016',:]

pop   48,171,392.0
Name: 2016, dtype: float64

In [116]:
df_sample.xs('Aruba')

           pop
year
2015 104,341.0
2016 104,872.0
2017 105,366.0
2018 105,845.0

In [118]:
df_sample.xs('2018', level = 'year')

                  pop
Country
Aruba       105,845.0
Colombia 49,648,685.0

In [119]:
df_countries = df_pob.set_index(['Country', 'year']).sort_index(ascending=[True, False])
df_countries

                          pop
Country     year
Afghanistan 2018 37,172,386.0
            2017 36,296,400.0
            2016 35,383,128.0
            2015 34,413,603.0
Albania     2018  2,866,376.0
...                       ...
Zambia      2015 15,879,361.0
Zimbabwe    2018 14,439,018.0
            2017 14,236,745.0
            2016 14,030,390.0
            2015 13,814,629.0

[1040 rows x 1 columns]

In [123]:
df_countries.groupby(level=1).sum()

                  pop
year
2015 65,679,147,019.0
2016 66,487,930,677.0
2017 67,294,176,701.0
2018 68,087,886,692.0

In [124]:
df_sample.unstack('year')

                  pop
year             2015         2016         2017         2018
Country
Aruba       104,341.0    104,872.0    105,366.0    105,845.0
Colombia 47,520,667.0 48,171,392.0 48,901,066.0 49,648,685.0

In [125]:
df_sample.unstack('Country')

              pop
Country     Aruba     Colombia
year
2015    104,341.0 47,520,667.0
2016    104,872.0 48,171,392.0
2017    105,366.0 48,901,066.0
2018    105,845.0 49,648,685.0

## Ahora a hacer algo de Joints en pandas

In [128]:
df_left = pd.DataFrame(
    {'X':['x0','x1','x2','x3'],
    'W':['w0','w1','w2','w3'],
    'Y':['y0','y1','y2','y3'],
    'Mix':['y2','y3','a2','a3']},
    index = [0, 1, 2, 3])

df_right = pd.DataFrame(
    {'Z':['z2','z3','z4','z5'],
     'A':['a2','a3','a4','a5'],
     'Y':['y2','y3','y4','y5']},
    index = [2,3,4,5])

In [129]:
pd.merge(df_left, df_right)

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

In [130]:
pd.merge(df_left, df_right, how='inner', on ='Y')

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

# Importando desde seaborn

In [131]:
import seaborn as sns
df = sns.load_dataset('diamonds')

In [132]:
df

       carat        cut color clarity  depth  table  price   x   y   z
0        0.2      Ideal     E     SI2   61.5   55.0    326 4.0 4.0 2.4
1        0.2    Premium     E     SI1   59.8   61.0    326 3.9 3.8 2.3
2        0.2       Good     E     VS1   56.9   65.0    327 4.0 4.1 2.3
3        0.3    Premium     I     VS2   62.4   58.0    334 4.2 4.2 2.6
4        0.3       Good     J     SI2   63.3   58.0    335 4.3 4.3 2.8
...      ...        ...   ...     ...    ...    ...    ...  ..  ..  ..
53935    0.7      Ideal     D     SI1   60.8   57.0   2757 5.8 5.8 3.5
53936    0.7       Good     D     SI1   63.1   55.0   2757 5.7 5.8 3.6
53937    0.7  Very Good     D     SI1   62.8   60.0   2757 5.7 5.7 3.6
53938    0.9    Premium     H     SI2   61.0   58.0   2757 6.2 6.1 3.7
53939    0.8      Ideal     D     SI2   62.2   55.0   2757 5.8 5.9 3.6

[53940 rows x 10 columns]

In [133]:
df.groupby('cut').mean()

           carat  depth  table   price   x   y   z
cut
Ideal        0.7   61.7   56.0 3,457.5 5.5 5.5 3.4
Premium      0.9   61.3   58.7 4,584.3 6.0 5.9 3.6
Very Good    0.8   61.8   58.0 3,981.8 5.7 5.8 3.6
Good         0.8   62.4   58.7 3,928.9 5.8 5.9 3.6
Fair         1.0   64.0   59.1 4,358.8 6.2 6.2 4.0

In [134]:
df.groupby('cut').median()

           carat  depth  table   price   x   y   z
cut
Ideal        0.5   61.8   56.0 1,810.0 5.2 5.3 3.2
Premium      0.9   61.4   59.0 3,185.0 6.1 6.1 3.7
Very Good    0.7   62.1   58.0 2,648.0 5.7 5.8 3.6
Good         0.8   63.4   58.0 3,050.5 6.0 6.0 3.7
Fair         1.0   65.0   58.0 3,282.0 6.2 6.1 4.0

In [135]:
for _ in [0, 1, 2, 3]:
    print(_)

0
1
2
3

In [137]:
for key_group, group in df.groupby('cut'):
    grouped_price = group['price'].mean()
    print(f'Cut: {key_group}, Price {grouped_price}')

Cut: Ideal, Price 3457.541970210199
Cut: Premium, Price 4584.2577042999055
Cut: Very Good, Price 3981.7598907465654
Cut: Good, Price 3928.864451691806
Cut: Fair, Price 4358.757763975155

In [140]:
df.groupby(['cut','color'])['price'].mean().to_frame()

                  price
cut       color
Ideal     D     2,629.1
          E     2,597.6
          F     3,374.9
          G     3,720.7
          H     3,889.3
          I     4,452.0
          J     4,918.2
Premium   D     3,631.3
          E     3,538.9
          F     4,324.9
          G     4,500.7
          H     5,216.7
          I     5,946.2
          J     6,294.6
Very Good D     3,470.5
          E     3,214.7
          F     3,778.8
          G     3,872.8
          H     4,535.4
          I     5,255.9
          J     5,103.5
Good      D     3,405.4
          E     3,423.6
          F     3,495.8
          G     4,123.5
          H     4,276.3
          I     5,078.5
          J     4,574.2
Fair      D     4,291.1
          E     3,682.3
          F     3,827.0
          G     4,239.3
          H     5,135.7
          I     4,685.4
          J     4,975.7

In [141]:
df.groupby(['cut','color'])['price'].aggregate(['min', np.mean, max])

                 min    mean    max
cut       color
Ideal     D      367 2,629.1  18693
          E      326 2,597.6  18729
          F      408 3,374.9  18780
          G      361 3,720.7  18806
          H      357 3,889.3  18760
          I      348 4,452.0  18779
          J      340 4,918.2  18508
Premium   D      367 3,631.3  18575
          E      326 3,538.9  18477
          F      342 4,324.9  18791
          G      382 4,500.7  18741
          H      368 5,216.7  18795
          I      334 5,946.2  18823
          J      363 6,294.6  18710
Very Good D      357 3,470.5  18542
          E      352 3,214.7  18731
          F      357 3,778.8  18777
          G      354 3,872.8  18818
          H      337 4,535.4  18803
          I      336 5,255.9  18500
          J      336 5,103.5  18430
Good      D      361 3,405.4  18468
          E      327 3,423.6  18236
          F      357 3,495.8  18686
          G      394 4,123.5  18788
          H      368 4,276.3  18640
          I      351 5,078.5  18707
          J      335 4,574.2  18325
Fair      D      536 4,291.1  16386
          E      337 3,682.3  15584
          F      496 3,827.0  17995
          G      369 4,239.3  18574
          H      659 5,135.7  18565
          I      735 4,685.4  18242
          J      416 4,975.7  18531

In [142]:
def mean_kilo(x):
    return np.mean(x)/1000

In [143]:
df.groupby(['cut','color'])['price'].aggregate(['min', np.mean, max, mean_kilo]).head(10)

               min    mean    max  mean_kilo
cut     color
Ideal   D      367 2,629.1  18693        2.6
        E      326 2,597.6  18729        2.6
        F      408 3,374.9  18780        3.4
        G      361 3,720.7  18806        3.7
        H      357 3,889.3  18760        3.9
        I      348 4,452.0  18779        4.5
        J      340 4,918.2  18508        4.9
Premium D      367 3,631.3  18575        3.6
        E      326 3,538.9  18477        3.5
        F      342 4,324.9  18791        4.3

In [144]:
dict_agg ={'carat':[min, max], 'price':[np.mean, mean_kilo]}

In [145]:
df.groupby(['cut', 'color']).aggregate(dict_agg)

                carat       price
                  min max    mean mean_kilo
cut       color
Ideal     D       0.2 2.8 2,629.1       2.6
          E       0.2 2.3 2,597.6       2.6
          F       0.2 2.5 3,374.9       3.4
          G       0.2 2.5 3,720.7       3.7
          H       0.2 3.5 3,889.3       3.9
          I       0.2 3.2 4,452.0       4.5
          J       0.2 3.0 4,918.2       4.9
Premium   D       0.2 2.6 3,631.3       3.6
          E       0.2 3.0 3,538.9       3.5
          F       0.2 3.0 4,324.9       4.3
          G       0.2 3.0 4,500.7       4.5
          H       0.2 3.2 5,216.7       5.2
          I       0.2 4.0 5,946.2       5.9
          J       0.3 4.0 6,294.6       6.3
Very Good D       0.2 2.6 3,470.5       3.5
          E       0.2 2.5 3,214.7       3.2
          F       0.2 2.5 3,778.8       3.8
          G       0.2 2.5 3,872.8       3.9
          H       0.2 3.0 4,535.4       4.5
          I       0.2 4.0 5,255.9       5.3
          J       0.2 2.7 5,103.5       5.1
Good      D       0.2 2.0 3,405.4       3.4
          E       0.2 3.0 3,423.6       3.4
          F       0.2 2.7 3,495.8       3.5
          G       0.2 2.8 4,123.5       4.1
          H       0.2 3.0 4,276.3       4.3
          I       0.3 3.0 5,078.5       5.1
          J       0.3 3.0 4,574.2       4.6
Fair      D       0.2 3.4 4,291.1       4.3
          E       0.2 2.0 3,682.3       3.7
          F       0.2 2.6 3,827.0       3.8
          G       0.2 2.6 4,239.3       4.2
          H       0.3 4.1 5,135.7       5.1
          I       0.4 3.0 4,685.4       4.7
          J       0.3 5.0 4,975.7       5.0

In [146]:
def f_filter(x):
    return mean_kilo(x['price'])>4

In [148]:
df.groupby('cut').filter(f_filter)['cut']

1        Premium
3        Premium
8           Fair
12       Premium
14       Premium
          ...
53928    Premium
53930    Premium
53931    Premium
53934    Premium
53938    Premium
Name: cut, Length: 15401, dtype: category
Categories (5, object): ['Ideal', 'Premium', 'Very Good', 'Good', 'Fair']

# Aggregation y Group By

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
pd.options.display.float_format = '{:,.3f}'.format

In [3]:
df = sns.load_dataset('tips')

In [4]:
df

     total_bill   tip     sex smoker   day    time  size
0        16.990 1.010  Female     No   Sun  Dinner     2
1        10.340 1.660    Male     No   Sun  Dinner     3
2        21.010 3.500    Male     No   Sun  Dinner     3
3        23.680 3.310    Male     No   Sun  Dinner     2
4        24.590 3.610  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239      29.030 5.920    Male     No   Sat  Dinner     3
240      27.180 2.000  Female    Yes   Sat  Dinner     2
241      22.670 2.000    Male    Yes   Sat  Dinner     2
242      17.820 1.750    Male     No   Sat  Dinner     2
243      18.780 3.000  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [5]:
df.describe(include = 'all')

        total_bill     tip   sex smoker  day    time    size
count      244.000 244.000   244    244  244     244 244.000
unique         NaN     NaN     2      2    4       2     NaN
top            NaN     NaN  Male     No  Sat  Dinner     NaN
freq           NaN     NaN   157    151   87     176     NaN
mean        19.786   2.998   NaN    NaN  NaN     NaN   2.570
std          8.902   1.384   NaN    NaN  NaN     NaN   0.951
min          3.070   1.000   NaN    NaN  NaN     NaN   1.000
25%         13.348   2.000   NaN    NaN  NaN     NaN   2.000
50%         17.795   2.900   NaN    NaN  NaN     NaN   2.000
75%         24.127   3.562   NaN    NaN  NaN     NaN   3.000
max         50.810  10.000   NaN    NaN  NaN     NaN   6.000

In [6]:
df['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [7]:
df['day'].value_counts() / df['day'].value_counts().sum() * 100

Sat    35.656
Sun    31.148
Thur   25.410
Fri     7.787
Name: day, dtype: float64

In [8]:
df.groupby('sex').mean()

        total_bill   tip  size
sex
Male        20.744 3.090 2.631
Female      18.057 2.833 2.460

In [9]:
df['prct_tip'] = df['tip']/df['total_bill']
df

     total_bill   tip     sex smoker   day    time  size  prct_tip
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147
..          ...   ...     ...    ...   ...     ...   ...       ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160

[244 rows x 8 columns]

In [10]:
df.groupby('sex').mean()

        total_bill   tip  size  prct_tip
sex
Male        20.744 3.090 2.631     0.158
Female      18.057 2.833 2.460     0.166

In [11]:
df.groupby('sex').median()

        total_bill   tip  size  prct_tip
sex
Male        18.350 3.000 2.000     0.153
Female      16.400 2.750 2.000     0.156

In [13]:
df.groupby('sex')[['total_bill','prct_tip']].describe()

       total_bill                                                prct_tip  \
            count   mean   std   min    25%    50%    75%    max    count
sex
Male      157.000 20.744 9.246 7.250 14.000 18.350 24.710 50.810  157.000
Female     87.000 18.057 8.009 3.070 12.750 16.400 21.520 44.300   87.000


        mean   std   min   25%   50%   75%   max
sex
Male   0.158 0.065 0.036 0.121 0.153 0.186 0.710
Female 0.166 0.054 0.056 0.140 0.156 0.194 0.417

In [14]:
def mean_eur2usd(x):
    return np.mean(x)*1.12

In [15]:
df.groupby('sex')[['total_bill','prct_tip']].apply(mean_eur2usd)

        total_bill  prct_tip
sex
Male        23.233     0.177
Female      20.224     0.186

In [16]:
df.groupby(['sex', 'time'])[['total_bill','prct_tip']].apply(mean_eur2usd)

               total_bill  prct_tip
sex    time
Male   Lunch       20.214     0.186
       Dinner      24.037     0.174
Female Lunch       18.300     0.182
       Dinner      21.519     0.190

In [18]:
df.groupby(['sex', 'time'])[['total_bill','prct_tip']].aggregate([np.mean, np.max, np.min, np.std])

              total_bill                    prct_tip
                    mean   amax  amin   std     mean  amax  amin   std
sex    time
Male   Lunch      18.048 41.190 7.510 7.953    0.166 0.266 0.079 0.046
       Dinner     21.461 50.810 7.250 9.461    0.155 0.710 0.036 0.069
Female Lunch      16.339 43.110 8.350 7.501    0.162 0.259 0.073 0.035
       Dinner     19.213 44.300 3.070 8.202    0.169 0.417 0.056 0.063

In [20]:
dict_agg = {
    'tip':[min, max],
    'total_bill':[np.mean, mean_eur2usd]
}

dict_agg

{'tip': [<function min>, <function max>],
 'total_bill': [<function numpy.mean(a, axis=None, dtype=None, out=None, keepdims=<no value>, *, where=<no value>)>,
  <function __main__.mean_eur2usd(x)>]}

In [21]:
df.groupby(['sex', 'time'])[['total_bill','tip']].aggregate(dict_agg)

                tip        total_bill
                min    max       mean mean_eur2usd
sex    time
Male   Lunch  1.440  6.700     18.048       20.214
       Dinner 1.000 10.000     21.461       24.037
Female Lunch  1.250  5.170     16.339       18.300
       Dinner 1.000  6.500     19.213       21.519

In [22]:
def f_filter(x):
    return mean_eur2usd(x['total_bill'].mean())>20

In [23]:
df.groupby(['sex', 'time']).filter(f_filter)

     total_bill   tip     sex smoker   day    time  size  prct_tip
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147
..          ...   ...     ...    ...   ...     ...   ...       ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160

[209 rows x 8 columns]

In [24]:
df_filtered = df.groupby(['sex', 'time']).filter(f_filter)

In [25]:
df_filtered.groupby(['sex','time']).count()

               total_bill  tip  smoker  day  size  prct_tip
sex    time
Male   Lunch           33   33      33   33    33        33
       Dinner         124  124     124  124   124       124
Female Lunch            0    0       0    0     0         0
       Dinner          52   52      52   52    52        52

## Variables categóricas con Group By